Upgrade test is failing due to the following reason - 
> 2025/04/17 09:47:00 Terraform plan | Terraform used the selected providers to generate the following execution
>          2025/04/17 09:47:00 Terraform plan | plan. Resource actions are indicated with the following symbols:
>          2025/04/17 09:47:00 Terraform plan |   + create
>          2025/04/17 09:47:00 Terraform plan |   ~ update in-place
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan | Terraform will perform the following actions:
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan |   # module.cbr_schematics_zone.ibm_cbr_zone.cbr_zone[0] will be created
>          2025/04/17 09:47:00 Terraform plan |   + resource "ibm_cbr_zone" "cbr_zone" {
>          2025/04/17 09:47:00 Terraform plan |       + account_id          = "abac0df06b644a9cabc6e44f55b3880e"
>          2025/04/17 09:47:00 Terraform plan |       + address_count       = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + created_at          = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + created_by_id       = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + crn                 = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + description         = "CBR Network zone for schematics"
>          2025/04/17 09:47:00 Terraform plan |       + etag                = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + excluded_count      = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + href                = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + id                  = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + last_modified_at    = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + last_modified_by_id = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + name                = "icl-adv-upg-tvoepd-schematics-network-zone"
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan |       + addresses {
>          2025/04/17 09:47:00 Terraform plan |           + type = "serviceRef"
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan |           + ref {
>          2025/04/17 09:47:00 Terraform plan |               + account_id   = "abac0df06b644a9cabc6e44f55b3880e"
>          2025/04/17 09:47:00 Terraform plan |               + service_name = "schematics"
>          2025/04/17 09:47:00 Terraform plan |             }
>          2025/04/17 09:47:00 Terraform plan |         }
>          2025/04/17 09:47:00 Terraform plan |     }
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan |   # module.cloud_logs.module.cbr_rule[0].ibm_cbr_rule.cbr_rule will be created
>          2025/04/17 09:47:00 Terraform plan |   + resource "ibm_cbr_rule" "cbr_rule" {
>          2025/04/17 09:47:00 Terraform plan |       + created_at          = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + created_by_id       = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + crn                 = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + description         = "icl-adv-upg-tvoepd-icl access only from schematics"
>          2025/04/17 09:47:00 Terraform plan |       + enforcement_mode    = "report"
>          2025/04/17 09:47:00 Terraform plan |       + etag                = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + href                = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + id                  = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + last_modified_at    = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |       + last_modified_by_id = (known after apply)
>          [2025](https://github.com/terraform-ibm-modules/terraform-ibm-cloud-logs/actions/runs/14512121608/job/40713247935#step:7:2026)/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan |       + contexts {
>          2025/04/17 09:47:00 Terraform plan |           + attributes {
>          2025/04/17 09:47:00 Terraform plan |               + name  = "endpointType"
>          2025/04/17 09:47:00 Terraform plan |               + value = "private"
>          2025/04/17 09:47:00 Terraform plan |             }
>          2025/04/17 09:47:00 Terraform plan |           + attributes {
>          2025/04/17 09:47:00 Terraform plan |               + name  = "networkZoneId"
>          2025/04/17 09:47:00 Terraform plan |               + value = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |             }
>          2025/04/17 09:47:00 Terraform plan |         }
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan |       + operations {
>          2025/04/17 09:47:00 Terraform plan |           + api_types {
>          2025/04/17 09:47:00 Terraform plan |               + api_type_id  = "crn:v1:bluemix:public:context-based-restrictions::::api-type:"
>          2025/04/17 09:47:00 Terraform plan |               + description  = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |               + display_name = (known after apply)
>          2025/04/17 09:47:00 Terraform plan |             }
>          2025/04/17 09:47:00 Terraform plan |         }
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan |       + resources {
>          2025/04/17 09:47:00 Terraform plan |           + attributes {
>          2025/04/17 09:47:00 Terraform plan |               + name     = "accountId"
>          2025/04/17 09:47:00 Terraform plan |               + value    = "abac0df06b644a9cabc6e44f55b3880e"
>          2025/04/17 09:47:00 Terraform plan |                 # (1 unchanged attribute hidden)
>          2025/04/17 09:47:00 Terraform plan |             }
>          2025/04/17 09:47:00 Terraform plan |           + attributes {
>          2025/04/17 09:47:00 Terraform plan |               + name     = "serviceInstance"
>          2025/04/17 09:47:00 Terraform plan |               + operator = "stringEquals"
>          2025/04/17 09:47:00 Terraform plan |               + value    = "f4d60a3d-1402-4aa6-8aa7-cea170adddac"
>          2025/04/17 09:47:00 Terraform plan |             }
>          2025/04/17 09:47:00 Terraform plan |           + attributes {
>          2025/04/17 09:47:00 Terraform plan |               + name     = "serviceName"
>          2025/04/17 09:47:00 Terraform plan |               + value    = "logs"
>          2025/04/17 09:47:00 Terraform plan |                 # (1 unchanged attribute hidden)
>          2025/04/17 09:47:00 Terraform plan |             }
>          2025/04/17 09:47:00 Terraform plan |         }
>          2025/04/17 09:47:00 Terraform plan |     }
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan |   # module.key_protect.module.key_protect[0].ibm_resource_instance.key_protect_instance will be updated in-place
>          2025/04/17 09:47:00 Terraform plan |   ~ resource "ibm_resource_instance" "key_protect_instance" {
>          2025/04/17 09:47:00 Terraform plan |         id                      = "crn:v1:bluemix:public:kms:eu-es:a/abac0df06b644a9cabc6e44f55b3880e:39ed7e2b-6e1a-4a21-b2c0-6e0190fa3628::"
>          2025/04/17 09:47:00 Terraform plan |         name                    = "icl-adv-upg-tvoepd-kp"
>          2025/04/17 09:47:00 Terraform plan |       ~ parameters              = {
>          2025/04/17 09:47:00 Terraform plan |           ~ "allowed_network" = "public-and-private" -> "private-only"
>          2025/04/17 09:47:00 Terraform plan |         }
>          2025/04/17 09:47:00 Terraform plan |         tags                    = [
>          2025/04/17 09:47:00 Terraform plan |             "schematics:us-east.workspace.icl-adv-upg-tvoepd.c1baa982",
>          2025/04/17 09:47:00 Terraform plan |         ]
>          2025/04/17 09:47:00 Terraform plan |         # (37 unchanged attributes hidden)
>          2025/04/17 09:47:00 Terraform plan |     }
>          2025/04/17 09:47:00 Terraform plan | 
>          2025/04/17 09:47:00 Terraform plan | Plan: 2 to add, 1 to change, 0 to destroy.